# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@ ============================================================== @@@
# @@@ ========================== COUNTING ========================== @@@
# @@@ ============================================================== @@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

counting_label = \
    ' @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@' \
    '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n' \
    ' @@@ ===============================' \
    '=============================== @@@\n' \
    ' @@@ ========================== COUNT'\
    'ING ========================== @@@\n' \
    ' @@@ ================================'\
    '============================== @@@\n' \
    ' @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'\
    '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\n'

cntrs_dict_marker = '%cntrs_dict%'
cntrs_dict_cnfg_text = \
    'Словарь для классификации счетчиков. Ключи - назначения\n' \
    'счетчиков на русском, значения - принятые в проекте\n' \
    'отличительные части названий для счетчиков.\n' \
    f'{cntrs_dict_marker}\n' \
    'Смежные системы: XSY\n' \
    'Пожары: XFRX\n' \
    'Имитации: XCIM\n' \
    'Ремонты: XRPX\n' \
    'Неисправности: FXXX\n' \
    'Недостоверности: DVXX\n' \
    'Внимания: XWRX\n' \
    f'{cntrs_dict_marker}\n\n' \

config_file_text = [
    counting_label,
    cntrs_dict_cnfg_text,
]
